---
kind: other
id: Methods.T:Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService
source: html/a0ac46b0-4b1a-3939-4d8f-f6c3f9ee49dd.htm
---
# FabricationNetworkChangeService Methods

Applies the previously set changes to the selection of fabrication parts to change the size, change the service, or both.